{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Shringara",
    "1": "Hasya",
    "2": "Karuna",
    "3": "Raudra",
    "4": "Vira",
    "5": "Bhayanaka",
    "6": "Bibhatsa",
    "7": "Adbhuta",
    "8": "Shanta"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Adbhuta": 7,
    "Bhayanaka": 5,
    "Bibhatsa": 6,
    "Hasya": 1,
    "Karuna": 2,
    "Raudra": 3,
    "Shanta": 8,
    "Shringara": 0,
    "Vira": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
